memcpy:
;-------------------
;【スタックフレームの構築】
;-------------------
		;BP+8|バイト数
		;BP+6|コピー元
		;BP+4|コピー先
		;----|---------
push bp		;BP+2|IP(戻り値番地)
mov bp,ps	;BP+0|BP(元の値)


;-------------------
;【レジスタの保存】
;-------------------
push cx
push si
push di


;-------------------
;【バイト単位でのコピー】
;-------------------
cld		;DF=0;+方向
mov di,[bp + 4] ;DI = コピー先
mov si,[bp + 6] ;SI = コピー元
mov cx,[bp + 8] ;CX = バイト数

req movsb	;while(*DI++ = *SI++)


;-------------------
;【レジスタの復帰】保存時の逆順でpop
;-------------------
pop di
pop si
pop cx


;-------------------
;【スタックフレームの破棄】
;-------------------
mov sp,bp
pop bp

ret
